if(1234) : print("참이면 보여요")
if(0) : print("거짓이면 안 보여요")
# 0,1이 아닌 모든 값 ==> 값이 존재한다고 인식 ==> 결과:True
# 0 ==> False로 인식 ==> 결과:False
# 1 ==> True로 인식 ==> 결과:True
print("---------------------")

# OR 비트 연산자
print(10 | 7)
print(123 | 456)
print(0xFFFF | 0x0000)
print("---------------------")

# XOR 비트 연산자
print(10 ^ 7)
print(123 ^ 456)
print(0xFFFF ^ 0x0000)
print("---------------------") 

# 보수 연산자
a = 10      # 2진법: 00001010 
print(~a)   # 1의보수 : 11110101 ====> -(00001010 + 00000001) = (-00001011) ====> <10진법> -11
print(~a+1) # 2의보수 : 11110101 + 00000001 = 11110110 ====> -(00001001 + 00000001) = (-00001010) ====> <10진법> -10

# 보수연산자로 나온 2진법 결과를 10진수로 변환하는 방법은 다시 2의보수 연산을 진행하면 된다.
print("---------------------") 

# 왼쪽 시프트 연산자
a = 10          # 2진법: 00001010
print(a << 1)   # 2진법: 00010100
print(a << 2)   # 2진법: 00101000
print(a << 3)   # 2진법: 01010000
print(a << 4)   # 2진법: 10100000
print("---------------------")

# 오른쪽 시프트 연산자
a = 10          # 2진법: 00001010
print(a >> 1)   # 2진법: 00000101
print(a >> 2)   # 2진법: 00000010
print(a >> 3)   # 2진법: 00000001
print(a >> 4)   # 2진법: 00000000
print("---------------------")

# if문
a = 99
if a<100:
    print("100보다 작군요.")
else:
    print("거짓이므로 이 문장은 안 보이겠죠?")

print("프로그램 끝")
print("---------------------")

# if문 크기 비교
a = 200

if a < 100 :
    print("100보다 작군요.")
else :
    print("100보다 크군요.")

# if문 홀짝 판별
a = int(input("정수를 입력하세요 : "))

if a % 2 == 0 :
    print("짝수를 입력했군요.")
else :
    print("홀수를 입력했군요.")
print("---------------------")    

# 삼항 연산자
score = 55
result='합격' if score>=60 else '불합격'
print(result)
print("---------------------")

# if elif else
score = int(input("점수를 입력하세요 : "))

if score>=90 :
    print("A")
elif score>=80 :
    print("B")
elif score>=70 :
    print("C")
elif score>=60 :
    print("D")
else:
    print("F") 

print("학점입니다. ^^")
print("---------------------")